[
    {
        "id": 1,
        "textEn": "Whoever fasts Ramadan out of faith and seeking reward will have his past sins forgiven.",
        "textAr": "من صام رمضان إيماناً واحتساباً غفر له ما تقدم من ذنبه",
        "reference": "Sahih al-Bukhari & Muslim",
        "takeawayEn": "Focus on the intention (Niyyah) of your fast to maximize its spiritual benefit.",
        "takeawayAr": "جدد نيتك في كل يوم من أيام الصيام لتعظيم الأجر واحتساب الثواب."
    },
    {
        "id": 2,
        "textEn": "The most beloved deeds to Allah are those that are consistent, even if they are small.",
        "textAr": "أحب الأعمال إلى الله أدومها وإن قل",
        "reference": "Sahih al-Bukhari",
        "takeawayEn": "Pick one small good deed today and commit to doing it every day of Ramadan.",
        "takeawayAr": "اختر عملاً صالحاً بسيطاً اليوم والتزم به طوال شهر رمضان."
    },
    {
        "id": 3,
        "textEn": "The one who guides others to good will have a reward like the one who does it.",
        "textAr": "من دل على خير فله مثل أجر فاعله",
        "reference": "Jami' at-Tirmidhi",
        "takeawayEn": "Sharing beneficial knowledge or a helpful app is an easy way to multiply your rewards.",
        "takeawayAr": "نشر الخير ومشاركة العلم النافع يضاعف أجرك كأنك قمت بالعمل نفسه."
    },
    {
        "id": 4,
        "textEn": "Take Suhoor, for in Suhoor there is blessing.",
        "textAr": "تسحروا فإن في السحور بركة",
        "reference": "Sahih al-Bukhari & Muslim",
        "takeawayEn": "Even if it's just a date and water, don't skip Suhoor to sustain your energy for worship.",
        "takeawayAr": "لا تترك السحور ولو ب تمرة وجرعة ماء، ففيه تقوية للبدن على العبادة."
    },
    {
        "id": 5,
        "textEn": "When one of you breaks his fast, let him break it with dates; if he cannot find any, then with water, for it is purifying.",
        "textAr": "إذا أفطر أحدكم فليفطر على تمر، فإن لم يجد فليفطر على ماء فإنه طهور",
        "reference": "Sunan Abu Dawud",
        "takeawayEn": "Follow the Sunnah of breaking fast with dates to follow the Prophet's guidance for health and reward.",
        "takeawayAr": "اتبع السنة بتناول التمر عند الإفطار لما فيه من خير صحي وأجر عظيم."
    },
    {
        "id": 6,
        "textEn": "The Prophet (ﷺ) was the most generous of people, and he was most generous during Ramadan.",
        "textAr": "كان النبي صلى الله عليه وسلم أجود الناس، وكان أجود ما يكون في رمضان",
        "reference": "Sahih al-Bukhari",
        "takeawayEn": "Be extra generous with your time, wealth, or even a smile today.",
        "takeawayAr": "كن كريماً في عطائك اليوم، سواء بالمال أو الجهد أو حتى الابتسامة."
    },
    {
        "id": 7,
        "textEn": "Fasting is a shield; so when one of you is fasting he should not use obscene language nor shout.",
        "textAr": "الصيام جنة، فلا يرفث ولا يجهل",
        "reference": "Sahih al-Bukhari",
        "takeawayEn": "True fasting is not just avoiding food, but protecting your character and speech.",
        "takeawayAr": "الصيام الحقيقي هو صيام الجوارح واللسان عن اللغو والغضب."
    }
]