{
    "deeds": [
        {
            "id": 1,
            "textEn": "Seek forgiveness (Istighfar) 100 times with focus and humility.",
            "textAr": "الاستغفار 100 مرة بتدبر وخشوع"
        },
        {
            "id": 2,
            "textEn": "Lower your gaze and guard your heart from spiritual distractions.",
            "textAr": "غض البصر وحفظ القلب من المشتتات"
        },
        {
            "id": 3,
            "textEn": "Keep your tongue moist with the remembrance of Allah throughout the day.",
            "textAr": "اجعل لسانك رطباً بذكر الله خلال يومك"
        },
        {
            "id": 4,
            "textEn": "Forgive someone who hurt you, seeking only the pleasure of Allah.",
            "textAr": "اعفُ عمن ظلمك، طلباً لمرضاة الله وحده"
        },
        {
            "id": 5,
            "textEn": "Read Juz' of the Quran with contemplation on its meanings.",
            "textAr": "قراءة جزء من القرآن مع التدبر في معانيه"
        },
        {
            "id": 6,
            "textEn": "Give charity secretly, as it extinguishes the anger of the Lord.",
            "textAr": "صدقة خفية، فإنها تطفئ غضب الرب"
        },
        {
            "id": 7,
            "textEn": "Guard your speech from backbiting, rumors, and idle talk.",
            "textAr": "حفظ اللسان عن الغيبة والنميمة وفضول الكلام"
        },
        {
            "id": 8,
            "textEn": "Make sincere Dua for those suffering around the world.",
            "textAr": "دعاء صادق للمستضعفين والمنكوبين في العالم"
        },
        {
            "id": 9,
            "textEn": "Maintain the kinship (Sila al-Rahim) with a call or visit.",
            "textAr": "صل رحمك باتصال أو زيادة مودة"
        },
        {
            "id": 10,
            "textEn": "Pray the Night Prayer (Tahajjud), even if it's just two Rak'ahs.",
            "textAr": "قيام الليل ولو بركعتين في جوف السحر"
        }
    ],
    "facts": [
        {
            "id": 1,
            "textEn": "The fast is half of patience, and patience is half of faith.",
            "textAr": "الصوم نصف الصبر، والصبر نصف الإيمان"
        },
        {
            "id": 2,
            "textEn": "Ramadan is the month of the Quran; seek to let its light illuminate your character.",
            "textAr": "رمضان شهر القرآن، فاجعل نوره يضيء أخلاقك"
        },
        {
            "id": 3,
            "textEn": "Every breath of a fasting person is a glorification of Allah.",
            "textAr": "أنفاس الصائم تسبيح، ونومه عبادة"
        },
        {
            "id": 4,
            "textEn": "True fasting is when your ears, eyes, and tongue fast from sin along with you.",
            "textAr": "إذا صمت فليصم سمعك وبصرك ولسانك عن المحارم"
        },
        {
            "id": 5,
            "textEn": "The fragrance of the fasting person's mouth is sweeter to Allah than musk.",
            "textAr": "خلوف فم الصائم أطيب عند الله من ريح المسك"
        },
        {
            "id": 6,
            "textEn": "Laylatul Qadr is a gift to the Ummah, better than a thousand months of worship.",
            "textAr": "ليلة القدر عطاء إلهي، هي خير من ألف شهر"
        },
        {
            "id": 7,
            "textEn": "Fasting is a shield; use it to protect your soul from the heat of desires.",
            "textAr": "الصيام جنة، فاجعله حرزاً لروحك من وهج الشهوات"
        },
        {
            "id": 8,
            "textEn": "In Paradise, there is a gate called Al-Rayyan, reserved only for those who fast.",
            "textAr": "في الجنة باب يقال له الريان، لا يدخله إلا الصائمون"
        },
        {
            "id": 9,
            "textEn": "Ramadan is a school of discipline; take its lessons into the rest of the year.",
            "textAr": "رمضان مدرسة التقوى، فاجعل دروسها منهاجاً لعامك"
        },
        {
            "id": 10,
            "textEn": "Silence in Ramadan is wisdom, and speech should be the remembrance of Allah.",
            "textAr": "صمت الصائم حكمة، ونطقه ذكر، وعمله مضاعف"
        }
    ]
}